---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsWarn
source: html/98b22907-0e37-4fad-237e-6641e15c0aa7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElementsWarn Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElementsWarn { get; }
```